#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/the-balance/matomo/runs/run-7a7GA1iKnDokWb8J

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
digitalocean_ssh_key.default: Refreshing state... [id=32416602]
digitalocean_database_cluster.matomo-backend: Refreshing state... [id=9f3b9adf-2617-4444-b054-9736053d7ddd]
digitalocean_droplet.matomo: Refreshing state... [id=274703882]
digitalocean_database_db.database: Refreshing state... [id=9f3b9adf-2617-4444-b054-9736053d7ddd/database/matomo]
digitalocean_floating_ip.matomo-ip: Refreshing state... [id=164.90.254.246]
digitalocean_firewall.web: Refreshing state... [id=2f595519-2a00-4b1c-9a3b-e8b0f9179498]
digitalocean_project.project: Refreshing state... [id=e627653e-c9f5-47fe-abb0-f136a9110024]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_database_cluster.matomo-backend must be replaced
-/+ resource "digitalocean_database_cluster" "matomo-backend" {
      ~ database             = "defaultdb" -> (known after apply)
      ~ host                 = "matomo-backend-db-cluster-do-user-10294674-0.b.db.ondigitalocean.com" -> (known after apply)
      ~ id                   = "9f3b9adf-2617-4444-b054-9736053d7ddd" -> (known after apply)
        name                 = "matomo-backend-db-cluster"
      ~ password             = (sensitive value)
      ~ port                 = 25060 -> (known after apply)
      ~ private_host         = "private-matomo-backend-db-cluster-do-user-10294674-0.b.db.ondigitalocean.com" -> (known after apply)
      ~ private_network_uuid = "8582f7ae-9598-463c-843c-da3967551114" -> (known after apply) # forces replacement
      ~ private_uri          = (sensitive value)
      - tags                 = [] -> null
      ~ uri                  = (sensitive value)
      ~ urn                  = "do:dbaas:9f3b9adf-2617-4444-b054-9736053d7ddd" -> (known after apply)
      ~ user                 = "doadmin" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # digitalocean_database_db.database must be replaced
-/+ resource "digitalocean_database_db" "database" {
      ~ cluster_id = "9f3b9adf-2617-4444-b054-9736053d7ddd" -> (known after apply) # forces replacement
      ~ id         = "9f3b9adf-2617-4444-b054-9736053d7ddd/database/matomo" -> (known after apply)
        name       = "matomo"
    }

  # digitalocean_droplet.matomo must be replaced
-/+ resource "digitalocean_droplet" "matomo" {
      ~ created_at           = "2021-11-21T20:30:47Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "274703882" -> (known after apply)
      ~ ipv4_address         = "161.35.120.14" -> (known after apply)
      ~ ipv4_address_private = "10.116.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "matomo-webserver"
      ~ price_hourly         = 0.00744 -> (known after apply)
      ~ price_monthly        = 5 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:274703882" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "8582f7ae-9598-463c-843c-da3967551114" -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.web will be updated in-place
  ~ resource "digitalocean_firewall" "web" {
      ~ droplet_ids     = [
          - 274703882,
        ] -> (known after apply)
        id              = "2f595519-2a00-4b1c-9a3b-e8b0f9179498"
        name            = "only-22-80-and-443"
        tags            = []
        # (3 unchanged attributes hidden)


        # (7 unchanged blocks hidden)
    }

  # digitalocean_floating_ip.matomo-ip will be updated in-place
  ~ resource "digitalocean_floating_ip" "matomo-ip" {
      ~ droplet_id = 274703882 -> (known after apply)
        id         = "164.90.254.246"
        # (3 unchanged attributes hidden)
    }

  # digitalocean_project.project will be updated in-place
  ~ resource "digitalocean_project" "project" {
        id          = "e627653e-c9f5-47fe-abb0-f136a9110024"
        name        = "website"
      ~ resources   = [
          - "do:dbaas:9f3b9adf-2617-4444-b054-9736053d7ddd",
          - "do:droplet:274703882",
          - "do:floatingip:164.90.254.246",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # digitalocean_vpc.matomo will be created
  + resource "digitalocean_vpc" "matomo" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.10.10.0/24"
      + name       = "matomo-private-network"
      + region     = "nyc1"
      + urn        = (known after apply)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ db-host = "private-matomo-backend-db-cluster-do-user-10294674-0.b.db.ondigitalocean.com" -> (known after apply)


```

</details>

*Pusher: @rexatlanti, Action: `workflow_run`, Working Directory: `terraform`, Workflow: `Terraform plan`*